; ModuleID = 'temp.bc'
source_filename = "../ac_ast_visitable.cc"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.13.0"

%"class.altered_carbon::js::AstVisitContext" = type { i8* }

; Function Attrs: noinline nounwind optnone ssp uwtable
define void @_ZN14altered_carbon2js15AstVisitContextC2EPv(%"class.altered_carbon::js::AstVisitContext"*, i8*) unnamed_addr #0 align 2 !dbg !960 {
  %3 = alloca %"class.altered_carbon::js::AstVisitContext"*, align 8
  %4 = alloca i8*, align 8
  store %"class.altered_carbon::js::AstVisitContext"* %0, %"class.altered_carbon::js::AstVisitContext"** %3, align 8
  call void @llvm.dbg.declare(metadata %"class.altered_carbon::js::AstVisitContext"** %3, metadata !974, metadata !DIExpression()), !dbg !976
  store i8* %1, i8** %4, align 8
  call void @llvm.dbg.declare(metadata i8** %4, metadata !977, metadata !DIExpression()), !dbg !978
  %5 = load %"class.altered_carbon::js::AstVisitContext"*, %"class.altered_carbon::js::AstVisitContext"** %3, align 8
  %6 = getelementptr inbounds %"class.altered_carbon::js::AstVisitContext", %"class.altered_carbon::js::AstVisitContext"* %5, i32 0, i32 0, !dbg !979
  %7 = load i8*, i8** %4, align 8, !dbg !980
  store i8* %7, i8** %6, align 8, !dbg !979
  ret void, !dbg !981
}

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: noinline nounwind optnone ssp uwtable

!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !137, line: 30, baseType: !109)
!140 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !141, file: !107, line: 165)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !137, line: 31, baseType: !113)
!142 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !143, file: !107, line: 166)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !137, line: 32, baseType: !116)
!144 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !145, file: !107, line: 168)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !137, line: 33, baseType: !120)
!146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !147, file: !107, line: 169)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !137, line: 34, baseType: !124)
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !149, file: !107, line: 170)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !137, line: 35, baseType: !128)
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !151, file: !107, line: 171)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !137, line: 36, baseType: !132)
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !153, file: !107, line: 173)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !137, line: 40, baseType: !104)
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !155, file: !107, line: 174)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !137, line: 41, baseType: !109)
!156 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !157, file: !107, line: 175)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !137, line: 42, baseType: !113)
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !159, file: !107, line: 176)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !137, line: 43, baseType: !116)
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !161, file: !107, line: 178)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !137, line: 44, baseType: !120)
!162 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !163, file: !107, line: 179)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !137, line: 45, baseType: !124)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !165, file: !107, line: 180)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !137, line: 46, baseType: !128)
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !167, file: !107, line: 181)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !137, line: 47, baseType: !132)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !169, file: !107, line: 183)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !170, line: 32, baseType: !171)
!170 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !172, line: 49, baseType: !14)
!172 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/i386/_types.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!173 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !174, file: !107, line: 184)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !175, line: 30, baseType: !18)
!175 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!176 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !177, file: !107, line: 186)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !178, line: 32, baseType: !14)
!178 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/_types/_intmax_t.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!179 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !180, file: !107, line: 187)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !181, line: 32, baseType: !18)
!181 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/_types/_uintmax_t.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !17, file: !183, line: 100)
!183 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/include/c++/v1/cstdlib", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !185, file: !183, line: 101)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !186, line: 85, baseType: !187)
!186 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/stdlib.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 82, size: 64, elements: !188, identifier: "_ZTS5div_t")
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !187, file: !186, line: 83, baseType: !55, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !187, file: !186, line: 84, baseType: !55, size: 32, offset: 32)
!191 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !192, file: !183, line: 102)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !186, line: 90, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 87, size: 128, elements: !194, identifier: "_ZTS6ldiv_t")
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !193, file: !186, line: 88, baseType: !14, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !193, file: !186, line: 89, baseType: !14, size: 64, offset: 64)
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !198, file: !183, line: 104)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !186, line: 96, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 93, size: 128, elements: !200, identifier: "_ZTS7lldiv_t")
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !199, file: !186, line: 94, baseType: !118, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !199, file: !186, line: 95, baseType: !118, size: 64, offset: 64)
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !204, file: !183, line: 106)
!204 = !DISubprogram(name: "atof", scope: !186, file: !186, line: 139, type: !205, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !41}
!207 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !209, file: !183, line: 107)
!209 = !DISubprogram(name: "atoi", scope: !186, file: !186, line: 140, type: !210, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!210 = !DISubroutineType(types: !211)
!211 = !{!55, !41}
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !213, file: !183, line: 108)
!213 = !DISubprogram(name: "atol", scope: !186, file: !186, line: 141, type: !214, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!214 = !DISubroutineType(types: !215)
!215 = !{!14, !41}
!216 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !217, file: !183, line: 110)
!217 = !DISubprogram(name: "atoll", scope: !186, file: !186, line: 144, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!218 = !DISubroutineType(types: !219)
!219 = !{!118, !41}
!220 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !221, file: !183, line: 112)
!221 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !186, file: !186, line: 170, type: !222, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!222 = !DISubroutineType(types: !223)
!223 = !{!207, !41, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !226, file: !183, line: 113)
!226 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !186, file: !186, line: 171, type: !227, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !41, !224}
!229 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !231, file: !183, line: 114)
!231 = !DISubprogram(name: "strtold", scope: !186, file: !186, line: 174, type: !232, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!232 = !DISubroutineType(types: !233)
!233 = !{!22, !41, !224}
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !235, file: !183, line: 115)
!235 = !DISubprogram(name: "strtol", scope: !186, file: !186, line: 172, type: !236, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!236 = !DISubroutineType(types: !237)
!237 = !{!14, !41, !224, !55}
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !239, file: !183, line: 117)
!239 = !DISubprogram(name: "strtoll", scope: !186, file: !186, line: 177, type: !240, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!240 = !DISubroutineType(types: !241)
!241 = !{!118, !41, !224, !55}
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !243, file: !183, line: 119)
!243 = !DISubprogram(name: "strtoul", scope: !186, file: !186, line: 180, type: !244, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!244 = !DISubroutineType(types: !245)
!245 = !{!18, !41, !224, !55}
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !247, file: !183, line: 121)
!247 = !DISubprogram(name: "strtoull", scope: !186, file: !186, line: 183, type: !248, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!248 = !DISubroutineType(types: !249)
!249 = !{!134, !41, !224, !55}
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !251, file: !183, line: 123)
!251 = !DISubprogram(name: "rand", scope: !186, file: !186, line: 167, type: !252, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!252 = !DISubroutineType(types: !253)
!253 = !{!55}
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !255, file: !183, line: 124)
!255 = !DISubprogram(name: "srand", scope: !186, file: !186, line: 169, type: !256, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !130}
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !259, file: !183, line: 125)
!259 = !DISubprogram(name: "calloc", scope: !186, file: !186, line: 148, type: !260, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!260 = !DISubroutineType(types: !261)
!261 = !{!30, !17, !17}
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !263, file: !183, line: 126)
!263 = !DISubprogram(name: "free", scope: !186, file: !186, line: 151, type: !264, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !30}
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !267, file: !183, line: 127)
!267 = !DISubprogram(name: "malloc", scope: !186, file: !186, line: 160, type: !268, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!268 = !DISubroutineType(types: !269)
!269 = !{!30, !17}
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !271, file: !183, line: 128)
!271 = !DISubprogram(name: "realloc", scope: !186, file: !186, line: 168, type: !272, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!272 = !DISubroutineType(types: !273)
!273 = !{!30, !30, !17}
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !275, file: !183, line: 129)
!275 = !DISubprogram(name: "abort", scope: !186, file: !186, line: 136, type: !276, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!276 = !DISubroutineType(types: !277)
!277 = !{null}
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !279, file: !183, line: 130)
!279 = !DISubprogram(name: "atexit", scope: !186, file: !186, line: 138, type: !280, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!280 = !DISubroutineType(types: !281)
!281 = !{!55, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !284, file: !183, line: 131)
!284 = !DISubprogram(name: "exit", scope: !186, file: !186, line: 150, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !55}
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !288, file: !183, line: 132)
!288 = !DISubprogram(name: "_Exit", scope: !186, file: !186, line: 203, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !290, file: !183, line: 134)
!290 = !DISubprogram(name: "getenv", scope: !186, file: !186, line: 152, type: !291, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!291 = !DISubroutineType(types: !292)
!292 = !{!39, !41}
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !294, file: !183, line: 135)
!294 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !186, file: !186, line: 195, type: !210, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !296, file: !183, line: 137)
!296 = !DISubprogram(name: "bsearch", scope: !186, file: !186, line: 146, type: !297, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!297 = !DISubroutineType(types: !298)
!298 = !{!30, !31, !31, !17, !17, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!55, !31, !31}
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !303, file: !183, line: 138)
!303 = !DISubprogram(name: "qsort", scope: !186, file: !186, line: 165, type: !304, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !30, !17, !17, !299}
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !307, file: !183, line: 139)
!307 = !DISubprogram(name: "abs", linkageName: "_Z3absx", scope: !308, file: !308, line: 113, type: !309, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!308 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/include/c++/v1/stdlib.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!309 = !DISubroutineType(types: !310)
!310 = !{!118, !118}
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !312, file: !183, line: 140)
!312 = !DISubprogram(name: "labs", scope: !186, file: !186, line: 153, type: !313, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!313 = !DISubroutineType(types: !314)
!314 = !{!14, !14}
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !316, file: !183, line: 142)
!316 = !DISubprogram(name: "llabs", scope: !186, file: !186, line: 157, type: !309, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !318, file: !183, line: 144)
!318 = !DISubprogram(name: "div", linkageName: "_Z3divxx", scope: !308, file: !308, line: 118, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!319 = !DISubroutineType(types: !320)
!320 = !{!198, !118, !118}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !322, file: !183, line: 145)
!322 = !DISubprogram(name: "ldiv", scope: !186, file: !186, line: 154, type: !323, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!323 = !DISubroutineType(types: !324)
!324 = !{!192, !14, !14}
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !326, file: !183, line: 147)
!326 = !DISubprogram(name: "lldiv", scope: !186, file: !186, line: 158, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !328, file: !183, line: 149)
!328 = !DISubprogram(name: "mblen", scope: !186, file: !186, line: 161, type: !329, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!329 = !DISubroutineType(types: !330)
!330 = !{!55, !41, !17}
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !332, file: !183, line: 150)
!332 = !DISubprogram(name: "mbtowc", scope: !186, file: !186, line: 163, type: !333, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!333 = !DISubroutineType(types: !334)
!334 = !{!55, !335, !41, !17}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !338, file: !183, line: 151)
!338 = !DISubprogram(name: "wctomb", scope: !186, file: !186, line: 200, type: !339, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!339 = !DISubroutineType(types: !340)
!340 = !{!55, !39, !336}
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !342, file: !183, line: 152)
!342 = !DISubprogram(name: "mbstowcs", scope: !186, file: !186, line: 162, type: !343, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!343 = !DISubroutineType(types: !344)
!344 = !{!17, !335, !41, !17}
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !346, file: !183, line: 153)
!346 = !DISubprogram(name: "wcstombs", scope: !186, file: !186, line: 199, type: !347, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!347 = !DISubroutineType(types: !348)
!348 = !{!17, !39, !349, !17}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !352, file: !405, line: 108)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !353, line: 157, baseType: !354)
!353 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/_stdio.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !353, line: 126, size: 1216, elements: !355, identifier: "_ZTS7__sFILE")
!355 = !{!356, !358, !359, !360, !361, !362, !367, !368, !369, !373, !377, !385, !389, !390, !393, !394, !398, !402, !403, !404}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !354, file: !353, line: 127, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !354, file: !353, line: 128, baseType: !55, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !354, file: !353, line: 129, baseType: !55, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !354, file: !353, line: 130, baseType: !111, size: 16, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !354, file: !353, line: 131, baseType: !111, size: 16, offset: 144)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !354, file: !353, line: 132, baseType: !363, size: 128, offset: 192)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !353, line: 92, size: 128, elements: !364, identifier: "_ZTS6__sbuf")
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !363, file: !353, line: 93, baseType: !357, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !363, file: !353, line: 94, baseType: !55, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !354, file: !353, line: 133, baseType: !55, size: 32, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !354, file: !353, line: 136, baseType: !30, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !354, file: !353, line: 137, baseType: !370, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!55, !30}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !354, file: !353, line: 138, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!55, !30, !39, !55}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !354, file: !353, line: 139, baseType: !378, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !30, !381, !55}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !353, line: 81, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !383, line: 71, baseType: !384)
!383 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/sys/_types.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !172, line: 46, baseType: !118)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !354, file: !353, line: 140, baseType: !386, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!55, !30, !41, !55}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !354, file: !353, line: 143, baseType: !363, size: 128, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !354, file: !353, line: 144, baseType: !391, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !353, line: 98, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !354, file: !353, line: 145, baseType: !55, size: 32, offset: 896)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !354, file: !353, line: 148, baseType: !395, size: 24, offset: 928)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 24, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 3)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !354, file: !353, line: 149, baseType: !399, size: 8, offset: 952)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 8, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 1)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !354, file: !353, line: 152, baseType: !363, size: 128, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !354, file: !353, line: 155, baseType: !55, size: 32, offset: 1088)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !354, file: !353, line: 156, baseType: !381, size: 64, offset: 1152)
!405 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/include/c++/v1/cstdio", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !381, file: !405, line: 109)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !17, file: !405, line: 110)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !409, file: !405, line: 112)
!409 = !DISubprogram(name: "fclose", scope: !410, file: !410, line: 143, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!410 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/stdio.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!411 = !DISubroutineType(types: !412)
!412 = !{!55, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !415, file: !405, line: 113)
!415 = !DISubprogram(name: "fflush", scope: !410, file: !410, line: 146, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !417, file: !405, line: 114)
!417 = !DISubprogram(name: "setbuf", scope: !410, file: !410, line: 178, type: !418, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !413, !39}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !421, file: !405, line: 115)
!421 = !DISubprogram(name: "setvbuf", scope: !410, file: !410, line: 179, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!422 = !DISubroutineType(types: !423)
!423 = !{!55, !413, !39, !55, !17}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !425, file: !405, line: 116)
!425 = !DISubprogram(name: "fprintf", scope: !410, file: !410, line: 155, type: !426, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!426 = !DISubroutineType(types: !427)
!427 = !{!55, !413, !41, null}
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !429, file: !405, line: 117)
!429 = !DISubprogram(name: "fscanf", scope: !410, file: !410, line: 161, type: !426, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !431, file: !405, line: 118)
!431 = !DISubprogram(name: "snprintf", scope: !410, file: !410, line: 338, type: !432, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!432 = !DISubroutineType(types: !433)
!433 = !{!55, !39, !17, !41, null}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !435, file: !405, line: 119)
!435 = !DISubprogram(name: "sprintf", scope: !410, file: !410, line: 180, type: !436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!436 = !DISubroutineType(types: !437)
!437 = !{!55, !39, !41, null}
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !439, file: !405, line: 120)
!439 = !DISubprogram(name: "sscanf", scope: !410, file: !410, line: 181, type: !440, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!440 = !DISubroutineType(types: !441)
!441 = !{!55, !41, !41, null}
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !443, file: !405, line: 121)
!443 = !DISubprogram(name: "vfprintf", scope: !410, file: !410, line: 190, type: !444, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!444 = !DISubroutineType(types: !445)
!445 = !{!55, !413, !41, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !448, identifier: "_ZTS13__va_list_tag")
!448 = !{!449, !450, !451, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !447, file: !1, baseType: !130, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !447, file: !1, baseType: !130, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !447, file: !1, baseType: !30, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !447, file: !1, baseType: !30, size: 64, offset: 128)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !454, file: !405, line: 122)
!454 = !DISubprogram(name: "vfscanf", scope: !410, file: !410, line: 339, type: !444, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !456, file: !405, line: 123)
!456 = !DISubprogram(name: "vsscanf", scope: !410, file: !410, line: 342, type: !457, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!457 = !DISubroutineType(types: !458)
!458 = !{!55, !41, !41, !446}
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !460, file: !405, line: 124)
!460 = !DISubprogram(name: "vsnprintf", scope: !410, file: !410, line: 341, type: !461, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!461 = !DISubroutineType(types: !462)
!462 = !{!55, !39, !17, !41, !446}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !464, file: !405, line: 125)
!464 = !DISubprogram(name: "vsprintf", scope: !410, file: !410, line: 192, type: !465, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!465 = !DISubroutineType(types: !466)
!466 = !{!55, !39, !41, !446}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !468, file: !405, line: 126)
!468 = !DISubprogram(name: "fgetc", scope: !410, file: !410, line: 147, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !470, file: !405, line: 127)
!470 = !DISubprogram(name: "fgets", scope: !410, file: !410, line: 149, type: !471, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!471 = !DISubroutineType(types: !472)
!472 = !{!39, !39, !55, !413}
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !474, file: !405, line: 128)
!474 = !DISubprogram(name: "fputc", scope: !410, file: !410, line: 156, type: !475, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!475 = !DISubroutineType(types: !476)
!476 = !{!55, !55, !413}
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !478, file: !405, line: 129)
!478 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !410, file: !410, line: 157, type: !479, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!479 = !DISubroutineType(types: !480)
!480 = !{!55, !41, !413}
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !482, file: !405, line: 130)
!482 = !DISubprogram(name: "getc", scope: !410, file: !410, line: 166, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !484, file: !405, line: 131)
!484 = !DISubprogram(name: "putc", scope: !410, file: !410, line: 171, type: !475, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !486, file: !405, line: 132)
!486 = !DISubprogram(name: "ungetc", scope: !410, file: !410, line: 189, type: !475, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !488, file: !405, line: 133)
!488 = !DISubprogram(name: "fread", scope: !410, file: !410, line: 158, type: !489, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!489 = !DISubroutineType(types: !490)
!490 = !{!17, !30, !17, !17, !413}
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !492, file: !405, line: 134)
!492 = !DISubprogram(name: "fwrite", linkageName: "\01_fwrite", scope: !410, file: !410, line: 165, type: !493, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!493 = !DISubroutineType(types: !494)
!494 = !{!17, !31, !17, !17, !413}
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !496, file: !405, line: 135)
!496 = !DISubprogram(name: "fgetpos", scope: !410, file: !410, line: 148, type: !497, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!497 = !DISubroutineType(types: !498)
!498 = !{!55, !413, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !501, file: !405, line: 136)
!501 = !DISubprogram(name: "fseek", scope: !410, file: !410, line: 162, type: !502, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!502 = !DISubroutineType(types: !503)
!503 = !{!55, !413, !14, !55}
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !505, file: !405, line: 137)
!505 = !DISubprogram(name: "fsetpos", scope: !410, file: !410, line: 163, type: !506, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!506 = !DISubroutineType(types: !507)
!507 = !{!55, !413, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !511, file: !405, line: 138)
!511 = !DISubprogram(name: "ftell", scope: !410, file: !410, line: 164, type: !512, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!512 = !DISubroutineType(types: !513)
!513 = !{!14, !413}
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !515, file: !405, line: 139)
!515 = !DISubprogram(name: "rewind", scope: !410, file: !410, line: 176, type: !516, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !413}
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !519, file: !405, line: 140)
!519 = !DISubprogram(name: "clearerr", scope: !410, file: !410, line: 142, type: !516, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !521, file: !405, line: 141)
!521 = !DISubprogram(name: "feof", scope: !410, file: !410, line: 144, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !523, file: !405, line: 142)
!523 = !DISubprogram(name: "ferror", scope: !410, file: !410, line: 145, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !525, file: !405, line: 143)
!525 = !DISubprogram(name: "perror", scope: !410, file: !410, line: 169, type: !526, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !41}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !529, file: !405, line: 146)
!529 = !DISubprogram(name: "fopen", linkageName: "\01_fopen", scope: !410, file: !410, line: 153, type: !530, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!530 = !DISubroutineType(types: !531)
!531 = !{!413, !41, !41}
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !533, file: !405, line: 147)
!533 = !DISubprogram(name: "freopen", linkageName: "\01_freopen", scope: !410, file: !410, line: 159, type: !534, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!534 = !DISubroutineType(types: !535)
!535 = !{!413, !41, !41, !413}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !537, file: !405, line: 148)
!537 = !DISubprogram(name: "remove", scope: !410, file: !410, line: 174, type: !210, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !539, file: !405, line: 149)
!539 = !DISubprogram(name: "rename", scope: !410, file: !410, line: 175, type: !58, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !541, file: !405, line: 150)
!541 = !DISubprogram(name: "tmpfile", scope: !410, file: !410, line: 182, type: !542, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!542 = !DISubroutineType(types: !543)
!543 = !{!413}
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !545, file: !405, line: 151)
!545 = !DISubprogram(name: "tmpnam", scope: !410, file: !410, line: 188, type: !546, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!546 = !DISubroutineType(types: !547)
!547 = !{!39, !39}
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !549, file: !405, line: 155)
!549 = !DISubprogram(name: "getchar", scope: !410, file: !410, line: 167, type: !252, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !551, file: !405, line: 157)
!551 = !DISubprogram(name: "gets", scope: !410, file: !410, line: 168, type: !546, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !553, file: !405, line: 159)
!553 = !DISubprogram(name: "scanf", scope: !410, file: !410, line: 177, type: !554, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!554 = !DISubroutineType(types: !555)
!555 = !{!55, !41, null}
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !557, file: !405, line: 160)
!557 = !DISubprogram(name: "vscanf", scope: !410, file: !410, line: 340, type: !558, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!558 = !DISubroutineType(types: !559)
!559 = !{!55, !41, !446}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !561, file: !405, line: 164)
!561 = !DISubprogram(name: "printf", scope: !410, file: !410, line: 170, type: !554, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !563, file: !405, line: 165)
!563 = !DISubprogram(name: "putchar", scope: !410, file: !410, line: 172, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!564 = !DISubroutineType(types: !565)
!565 = !{!55, !55}
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !567, file: !405, line: 166)
!567 = !DISubprogram(name: "puts", scope: !410, file: !410, line: 173, type: !210, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !569, file: !405, line: 167)
!569 = !DISubprogram(name: "vprintf", scope: !410, file: !410, line: 191, type: !558, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !571, file: !573, line: 104)
!571 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !572, file: !572, line: 212, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!572 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/_ctype.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!573 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/include/c++/v1/cctype", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !575, file: !573, line: 105)
!575 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !572, file: !572, line: 218, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !577, file: !573, line: 106)
!577 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !572, file: !572, line: 224, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !579, file: !573, line: 107)
!579 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !572, file: !572, line: 230, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !581, file: !573, line: 108)
!581 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !572, file: !572, line: 237, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !583, file: !573, line: 109)
!583 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !572, file: !572, line: 243, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !585, file: !573, line: 110)
!585 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !572, file: !572, line: 249, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !587, file: !573, line: 111)
!587 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !572, file: !572, line: 255, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !589, file: !573, line: 112)
!589 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !572, file: !572, line: 261, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !591, file: !573, line: 113)
!591 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !572, file: !572, line: 267, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !593, file: !573, line: 114)
!593 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !572, file: !572, line: 273, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !595, file: !573, line: 115)
!595 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !572, file: !572, line: 280, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !597, file: !573, line: 116)
!597 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !572, file: !572, line: 292, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !599, file: !573, line: 117)
!599 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !572, file: !572, line: 298, type: !564, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !601, file: !604, line: 63)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !602, line: 32, baseType: !603)
!602 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/sys/_types/_wint_t.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !172, line: 112, baseType: !55)
!604 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/include/c++/v1/cwctype", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !606, file: !604, line: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !607, line: 32, baseType: !608)
!607 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/_types/_wctrans_t.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !609, line: 41, baseType: !55)
!609 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/_types.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !611, file: !604, line: 65)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !612, line: 32, baseType: !613)
!612 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/_types/_wctype_t.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !609, line: 43, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !172, line: 45, baseType: !130)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !616, file: !604, line: 66)
!616 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !617, file: !617, line: 51, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!617 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/_wctype.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!618 = !DISubroutineType(types: !619)
!619 = !{!55, !601}
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !621, file: !604, line: 67)
!621 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !617, file: !617, line: 57, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !623, file: !604, line: 68)
!623 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !624, file: !624, line: 50, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!624 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/wctype.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !626, file: !604, line: 69)
!626 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !617, file: !617, line: 63, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !628, file: !604, line: 70)
!628 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !617, file: !617, line: 75, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !630, file: !604, line: 71)
!630 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !617, file: !617, line: 81, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !632, file: !604, line: 72)
!632 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !617, file: !617, line: 87, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !634, file: !604, line: 73)
!634 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !617, file: !617, line: 93, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !636, file: !604, line: 74)
!636 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !617, file: !617, line: 99, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !638, file: !604, line: 75)
!638 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !617, file: !617, line: 105, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !640, file: !604, line: 76)
!640 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !617, file: !617, line: 111, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !642, file: !604, line: 77)
!642 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !617, file: !617, line: 117, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !644, file: !604, line: 78)
!644 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !617, file: !617, line: 69, type: !645, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!645 = !DISubroutineType(types: !646)
!646 = !{!55, !601, !611}
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !648, file: !604, line: 79)
!648 = !DISubprogram(name: "wctype", scope: !617, file: !617, line: 157, type: !649, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!649 = !DISubroutineType(types: !650)
!650 = !{!611, !41}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !652, file: !604, line: 80)
!652 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !617, file: !617, line: 123, type: !653, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!653 = !DISubroutineType(types: !654)
!654 = !{!601, !601}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !656, file: !604, line: 81)
!656 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !617, file: !617, line: 129, type: !653, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !658, file: !604, line: 82)
!658 = !DISubprogram(name: "towctrans", scope: !624, file: !624, line: 121, type: !659, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!659 = !DISubroutineType(types: !660)
!660 = !{!601, !601, !606}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !662, file: !604, line: 83)
!662 = !DISubprogram(name: "wctrans", scope: !624, file: !624, line: 123, type: !663, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!663 = !DISubroutineType(types: !664)
!664 = !{!606, !41}
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !666, file: !677, line: 116)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !667, line: 32, baseType: !668)
!667 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/sys/_types/_mbstate_t.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !172, line: 81, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !172, line: 79, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 76, size: 1024, elements: !671, identifier: "_ZTS11__mbstate_t")
!671 = !{!672, !676}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !670, file: !172, line: 77, baseType: !673, size: 1024)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !670, file: !172, line: 78, baseType: !118, size: 64)
!677 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/include/c++/v1/cwchar", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !17, file: !677, line: 117)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !680, file: !677, line: 118)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !681, line: 74, size: 448, elements: !682, identifier: "_ZTS2tm")
!681 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/time.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !680, file: !681, line: 75, baseType: !55, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !680, file: !681, line: 76, baseType: !55, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !680, file: !681, line: 77, baseType: !55, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !680, file: !681, line: 78, baseType: !55, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !680, file: !681, line: 79, baseType: !55, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !680, file: !681, line: 80, baseType: !55, size: 32, offset: 160)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !680, file: !681, line: 81, baseType: !55, size: 32, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !680, file: !681, line: 82, baseType: !55, size: 32, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !680, file: !681, line: 83, baseType: !55, size: 32, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !680, file: !681, line: 84, baseType: !14, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !680, file: !681, line: 85, baseType: !39, size: 64, offset: 384)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !601, file: !677, line: 119)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !352, file: !677, line: 120)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !697, file: !677, line: 121)
!697 = !DISubprogram(name: "fwprintf", scope: !698, file: !698, line: 103, type: !699, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!698 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.13.sdk/usr/include/wchar.h", directory: "/Users/ejiang/Projects/lls/ac/llfiles")
!699 = !DISubroutineType(types: !700)
!700 = !{!55, !413, !349, null}
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !702, file: !677, line: 122)
!702 = !DISubprogram(name: "fwscanf", scope: !698, file: !698, line: 104, type: !699, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !704, file: !677, line: 123)
!704 = !DISubprogram(name: "swprintf", scope: !698, file: !698, line: 115, type: !705, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!705 = !DISubroutineType(types: !706)
!706 = !{!55, !335, !17, !349, null}
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !708, file: !677, line: 124)
!708 = !DISubprogram(name: "vfwprintf", scope: !698, file: !698, line: 118, type: !709, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!709 = !DISubroutineType(types: !710)
!710 = !{!55, !413, !349, !446}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !712, file: !677, line: 125)
!712 = !DISubprogram(name: "vswprintf", scope: !698, file: !698, line: 120, type: !713, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!713 = !DISubroutineType(types: !714)
!714 = !{!55, !335, !17, !349, !446}
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !716, file: !677, line: 126)
!716 = !DISubprogram(name: "swscanf", scope: !698, file: !698, line: 116, type: !717, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!717 = !DISubroutineType(types: !718)
!718 = !{!55, !349, !349, null}
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !720, file: !677, line: 127)
!720 = !DISubprogram(name: "vfwscanf", scope: !698, file: !698, line: 170, type: !709, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !722, file: !677, line: 128)
!722 = !DISubprogram(name: "vswscanf", scope: !698, file: !698, line: 172, type: !723, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!723 = !DISubroutineType(types: !724)
!724 = !{!55, !349, !349, !446}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !726, file: !677, line: 129)
!726 = !DISubprogram(name: "fgetwc", scope: !698, file: !698, line: 98, type: !727, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!727 = !DISubroutineType(types: !728)
!728 = !{!601, !413}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !730, file: !677, line: 130)
!730 = !DISubprogram(name: "fgetws", scope: !698, file: !698, line: 99, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!731 = !DISubroutineType(types: !732)
!732 = !{!335, !335, !55, !413}
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !734, file: !677, line: 131)
